// Вывести на одной строке числа 31, 18, 79 с одним пробелом между ними.

#include <iostream>
int main()
{
    using namespace std;
    short num_1 = 31;
    short num_2 = 18;
    short num_3 = 79;
    cout << num_1 << ' ' << num_2 << ' ' << num_3 << ' ' << endl;
    return 0;
}